import bourgeoisItems from '../../assets/img/bourgeois-items.jpg';
import bourgeoisReward from '../../assets/img/bourgeois-reward.jpg';
import bourgeoisPrices from '../../assets/img/bourgeois-prices.jpg';
import bourgeoisLvlReward from '../../assets/img/bourgeois-lvl-reward.jpg';
import bourgeoisItemsForTrade from '../../assets/img/bourgeois-items-for-trade.jpg';
import bourgeoisItemsForNewLvl from '../../assets/img/bourgeois-items-for-new-lvl.jpg';

import bourgeoisLvl1 from '../../assets/img/bourgeois-lvl-1.jpg';
import bourgeoisLvl2 from '../../assets/img/bourgeois-lvl-2.jpg';
import bourgeoisLvl3 from '../../assets/img/bourgeois-lvl-3.jpg';
import bourgeoisLvl4 from '../../assets/img/bourgeois-lvl-4.jpg';
import bourgeoisLvl5 from '../../assets/img/bourgeois-lvl-5.jpg';
import bourgeoisLvl6 from '../../assets/img/bourgeois-lvl-6.jpg';
import bourgeoisLvl7 from '../../assets/img/bourgeois-lvl-7.jpg';
import bourgeoisLvl8 from '../../assets/img/bourgeois-lvl-8.jpg';
import bourgeoisLvl9 from '../../assets/img/bourgeois-lvl-9.jpg';
import bourgeoisLvl10 from '../../assets/img/bourgeois-lvl-10.jpg';

export const BOURGEOISDESCRIPTION = {
  articleName: {
    ru: 'Буржуй: описание уровней и торговли',
    uk: 'Буржуй: опис рівней та торгівлі',
    en: '',
  },
  articleAddress: '/description_of_levels_and_trading',
  articleContent: [
    {
      element: 'p',
      value: {
        ru: 'Прежде всего стоит сразу разобраться во всех условных обозначениях. Так вы будете на лету понимать, что обозначает каждая надпись на каждой картинке.',
        uk: 'Перш за все, ви повинні розібратися в усіх умовних позначеннях. Так ви будете на літу розуміти, що означає кожен напис на кожній картинці.',
        en: '',
      },
    },
    {
      element: 'p',
      value: {
        ru: 'Это количество предмета, которое нужно сдать:',
        uk: 'Це кількість предмета, яку потрібно сдати:',
        en: '',
      },
    },
    {
      element: 'img',
      src: bourgeoisItems,
      alt: {
        ru: 'Количество предмета, которое нужно сдать',
        uk: 'Кількість предмета, яку потрібно сдати',
        en: '',
      },
      style: { width: '50%' },
    },
    {
      element: 'p',
      value: {
        ru: 'Это награда, которая даётся, когда сдал полностью именно этот предмет:',
        uk: 'Це нагорода, яка дається, коли повністю сдав цей предмет:',
        en: '',
      },
    },
    {
      element: 'img',
      src: bourgeoisReward,
      alt: {
        ru: 'Награда за сдачу всех предметов',
        uk: 'Винагорода за сдачу усіх предметів',
        en: '',
      },
      style: { width: '50%' },
    },
    {
      element: 'p',
      value: {
        ru: 'Это количество монеток, которое даётся за каждые 16 проданного конкретного предмета. Речь идёт не о сдаче при прохождении уровней, а о торговле этими предметами у Буржуя:',
        uk: 'Це кількість монет, які даються на кожні 16 проданих предметів. Йдеться не про здачу під час проходження рівнів, а про торгівлю цими предметами у Буржуа:',
        en: '',
      },
    },
    {
      element: 'img',
      src: bourgeoisPrices,
      alt: {
        ru: 'Количество монеток за каждые 16 предметов',
        uk: 'Кількість монет на кожні 16 предметів',
        en: '',
      },
      style: { width: '50%' },
    },
    {
      element: 'p',
      value: {
        ru: 'Это то, сколько даётся монеток за прохождение определенного уровня:',
        uk: 'Ось скільки монеток дається за проходження певного рівня:',
        en: '',
      },
    },
    {
      element: 'img',
      src: bourgeoisLvlReward,
      alt: {
        ru: 'Количество монеток за уровень',
        uk: 'Кількість монет на рівень',
        en: '',
      },
      style: { width: '50%' },
    },
    {
      element: 'p',
      value: {
        ru: 'Это количество предметов, которые предлагаются игроку для сдачи:',
        uk: 'Це кількість предметів, які пропонуються гравцеві для сдачі:',
        en: '',
      },
    },
    {
      element: 'img',
      src: bourgeoisItemsForTrade,
      alt: {
        ru: 'Количество предметов предложенных для сдачи',
        uk: 'Кількість предметів, запропонованих для сдачі',
        en: '',
      },
      style: { width: '50%' },
    },
    {
      element: 'p',
      value: {
        ru: 'Это количество предметов, которые нужно сдать для прохождения определенного уровня:',
        uk: 'Це кількість предметів, які необхідно сдати, щоб пройти певний рівень:',
        en: '',
      },
    },
    {
      element: 'img',
      src: bourgeoisItemsForNewLvl,
      alt: {
        ru: 'Количество предметов до нового уровня',
        uk: 'Кількість предметів на новий рівень',
        en: '',
      },
      style: { width: '50%' },
    },
    {
      element: 'hr',
    },
    {
      element: 'img',
      src: bourgeoisLvl1,
      alt: { ru: 'Описание 1 уровня', uk: 'Опис рівня 1', en: '' },
      style: { width: '100%' },
    },
    {
      element: 'p',
      value: {
        ru: 'В 1-м уровне вам предстоит изрядно попотеть на сельском огороде. Здесь может оказаться по-настоящему полезной практически любая ферма костной муки, так как с её помощью вы сможете с лёгкостью пропустить эти нудные десятки часов ожидания, пока весь урожай наконец созреет. Кроме этого, если вдруг вы решите полностью автоматизировать процесс, то любой инструмент с удачей 3 уровня или же кирка с удачей 4 уровня может оказаться как нельзя кстати.',
        uk: 'На 1-му рівні вам доведеться неабияк попотіти в сільському городі. Практично будь-яка ферма кісткового борошна тут може бути справді корисною, оскільки за допомогою її допомоги ви можете легко пропустити ці стомлюючі десятки годин очікувань, поки весь врожай нарешті дозріє. Крім того, якщо ви раптом вирішите повністю автоматизувати процес, то будь-який інструмент із удачею 3-го рівня або кірка з удачею 4-го рівня може виявитися дуже доречною.',
        en: '',
      },
    },
    {
      element: 'img',
      src: bourgeoisLvl2,
      alt: { ru: 'Описание 2 уровня', uk: 'Опис рівня 2', en: '' },
      style: { width: '100%' },
    },
    {
      element: 'p',
      value: {
        ru: 'Во 2-м уровне вам предстоит с головой углубиться в шахту. Особых лайфхаков тут быть не может, если говорить откровенно. Да, фича с алмазами и лазуритом могла бы помочь, но без какой-нибудь мощной кирки здесь при любых обстоятельствах придётся попотеть. Хотя, если вам посчастливится завладеть киркой с 10-й эффективностью, то прохождение уровня станет в десятки раз легче.',
        uk: 'На 2-му рівні вам доведеться з головою зануритися в шахту. Особливиї лайфаків тут не може бати, якщо говорити відверто. Так, функція з алмазами та лазуритом може допомогти, але без якої-небудь потужної кірки тут за будь-яких обставин вам доведеться потіти. Хоча, якщо вам пощастить заволодіти кіркою з 10-ю ефективністю, то проходження рівня стане в десятки разів легше.',
        en: '',
      },
    },
    {
      element: 'img',
      src: bourgeoisLvl3,
      alt: { ru: 'Описание 3 уровня', uk: 'Опис рівня 3', en: '' },
      style: { width: '100%' },
    },
    {
      element: 'p',
      value: {
        ru: 'В 3-м уровне вам будет нужно поковыряться в шерсти животных. Тут довольно неплохим вариантом было бы обзавестись спавнерами и яйцами всех возможных мирных мобов и построить для каждого из них отдельную ферму. Да, придётся немного пострадать, но в будущем продавая, например, стейки или вещи с кроликов, можно неплохо обогатиться.',
        uk: 'На 3-му рівні вам потрібно буде покопатися у вовні тварин. Тут досить непоганим варіантом було б обзавестися спавнерами та яйцями всіх можливих мирних мобів та побудувати окрему ферму для кожного з них. Так, доведеться трохи постраждати, але в майбутньому, продаючи, наприклад, стейки чи речі з кроликів, ви можете добре збагатися.',
        en: '',
      },
    },
    {
      element: 'img',
      src: bourgeoisLvl4,
      alt: { ru: 'Описание 4 уровня', uk: 'Опис рівня 4', en: '' },
      style: { width: '100%' },
    },
    {
      element: 'p',
      value: {
        ru: 'На 4-м уровне просто шикарным вариантом было бы побегать по миру, поискать различные сокровищницы и надеяться, что в каждой из них вам выпадет неповторяющийся моб. Благодаря этому практически все предметы будут собраны за считанные сутки игры. Единственное, что может вызвать трудности – это слизь. Хотя как болото, так и слаймчанки никто не отменял.',
        uk: 'На 4-му рівні було б чудовим варіантом побігати по всьому світу, пошукати різні скарбниці і сподіватися, що в кожній з них вам випаде неповторний моб. Завдяки цьому майже всі предмети будуть зібрані за день гри. Єдине, що може спричинити труднощі, – це слиз. Хоча, як болото і слаймчанки, ніхто не скасував.',
        en: '',
      },
    },
    {
      element: 'img',
      src: bourgeoisLvl5,
      alt: { ru: 'Описание 5 уровня', uk: 'Опис рівня 5', en: '' },
      style: { width: '100%' },
    },
    {
      element: 'p',
      value: {
        ru: 'Для прохождения 5-го уровня без каких-либо вариантов придётся углубиться в измерение адского мира. Тут, боимся, советы никакие не помогут. Только труд, только усердие.',
        uk: 'Щоб пройти 5-й рівень без будь-яких варіантів, вам доведеться заглибитися в вимірювання пекельного світу. Тут ми боїмося, порада не допоможе. Тільки праця, лише завзяття.',
        en: '',
      },
    },
    {
      element: 'img',
      src: bourgeoisLvl6,
      alt: { ru: 'Описание 6 уровня', uk: 'Опис рівня 6', en: '' },
      style: { width: '100%' },
    },
    {
      element: 'p',
      value: {
        ru: 'На версии 1.16.5, в отличие от версии 1.12.2, принцип работы АФК рыбалки кардинально изменился. Многие это не знают и в плохом луте винят сервер, однако если построить водоём 5х5х4, то из него будет падать целое море вкусного лута.',
        uk: 'У версії 1.16.5, на відміну від версії 1.12.2, принцип роботи риболовлі АФК кардинально змінився. Багато хто цього не знає і звинувачує сервер у поганому луті, але якщо ви побудуєте резервуар 5x5x4, то з нього впаде ціле море смачного лута.',
        en: '',
      },
    },
    {
      element: 'img',
      src: bourgeoisLvl7,
      alt: { ru: 'Описание 7 уровня', uk: 'Опис рівня 7', en: '' },
      style: { width: '100%' },
    },
    {
      element: 'p',
      value: {
        ru: 'На этом уровне вам предстоит изрядно попотеть в измерении Энда. Лайфхак оставим тут лишь один – стержни Энда можно крафтить.',
        uk: 'На цьому рівні вам доведеться попотіти в значній мірі у вимірі Енду. Лайфхак залишимо тут лише один – стрижні Енду можна створити.',
        en: '',
      },
    },
    {
      element: 'img',
      src: bourgeoisLvl8,
      alt: { ru: 'Описание 8 уровня', uk: 'Опис рівня 8', en: '' },
      style: { width: '100%' },
    },
    {
      element: 'p',
      value: {
        ru: 'Для прохождения этого уровня вам нужно.. Ух, тут действительно похоже вам не повезло, выражаем свои соболезнования. С такими то заданиями торговля с пиглинами может показаться весьма перспективным занятием…',
        uk: 'Щоб пройти цей рівень, вам потрібно.. Ух, тут справді вам не пощастило, ми висловлюємо співчуття. З такими то завданнями торгівля з піглінами може здатися дуже перспективним заняттям…',
        en: '',
      },
    },
    {
      element: 'img',
      src: bourgeoisLvl9,
      alt: { ru: 'Описание 9 уровня', uk: 'Опис рівня 9', en: '' },
      style: { width: '100%' },
    },
    {
      element: 'p',
      value: {
        ru: 'Обсидиан можно добыть визером, розы визера добываются из снеговиков, торты можно закупить у жителей. Аж неинтересно как-то…',
        uk: 'Обсидіан можна здобути візером, троянди візера добуваються із сніговиків, торти можна придбати у мешканців. Аж якось нецікаво…',
        en: '',
      },
    },
    {
      element: 'img',
      src: bourgeoisLvl10,
      alt: { ru: 'Описание 10 уровня', uk: 'Опис рівня 10', en: '' },
      style: { width: '100%' },
    },
    {
      element: 'p',
      value: {
        ru: 'Наконец финальный уровень. Для него довольно крутой затеей было бы сделать ферму рейдов. Она у нас на сервере работает замечательно, только следует учитывать лишь одну деталь – шанс выпадения тотемов на сервере очень сильно урезан. Но если построить такую ферму не одну, то дай Бог здоровья вашим нервным клеткам. Но прибыль того определённо стоить будет.',
        uk: "Нарешті фінальний рівень. Для нього досить крутою витівкою було б зробити ферму рейдів. Вона чудово працює на нашому сервері, слід враховувати лише одну делать – шанс падіння тотемів на сервер дуже сильно урізаний. Але якщо збудувати таку ферму не одну, то дай Бог здоров'я вашим нервовим клітинам. Але прибуток того безперечно коштуватиме.",
        en: '',
      },
    },
  ],
};
