import coinsFromMobsPeaceful from '../../assets/img/coins-from-mobs-peaceful.jpg';
import coinsFromMobsHostile from '../../assets/img/coins-from-mobs-hostile.jpg';
import coinsFromMobsNether from '../../assets/img/coins-from-mobs-nether.jpg';
import coinsFromMobsEnd from '../../assets/img/coins-from-mobs-end.jpg';

export const COINSFROMMOBS = {
  articleName: {
    ru: 'Монетки со всех мобов',
    uk: 'Монетки з усіх мобів',
    en: '',
  },
  articleAddress: '/coins_from_all_mobs',
  articleContent: [
    {
      element: 'p',
      value: {
        ru: 'В этой статье речь пойдёт о монетках, которые выпадают с мобов.',
        uk: 'У цій статті ми поговоримо про монети, які випадають з мобів.',
        en: '',
      },
    },
    {
      element: 'p',
      value: {
        ru: 'Достаточно частый вопрос среди новичков – какая фармилка будет самая выгодная, на основе чего следует строить себе ферму мобов? Возможно, благодаря этой статье вы сможете подобрать для себя идеальную комбинацию мобов в рассадниках, благодаря которой сможете зарабатывать целые горы монеток как на торговле ресурсами, которые выпадают в процессе фарма, так и непосредственно с самих мобов.',
        uk: 'Досить часте питання серед початківців – яка фармілка буде найвигіднішою, на основі чого слід будувати ферму мобів? Можливо, завдяки цій статті ви можете вибрати ідеальне поєднання мобів у розсадниках, завдяки якої ви зможете заробити цілі гори монет як на торгівлі ресурсами, які випадають під час процесу фарма, так і безпосередньо від самих мобів.',
        en: '',
      },
    },
    {
      element: 'p',
      value: {
        ru: 'Для удобства мы разделили всех существ на 4 категории: мирные мобы обычного мира, враждебные мобы обычного мира, мобы адского измерения, мобы измерения Энда.',
        uk: 'Для зручності ми розділили всіх істот на 4 категорії: мирні моби звичайного світу, ворожі моби звичайного світу, моби пекельного вимірювання, моби вимірювання Енда.',
        en: '',
      },
    },
    {
      element: 'img',
      src: coinsFromMobsPeaceful,
      alt: {
        ru: 'Монетки с мирных мобов в обычном мире',
        uk: 'Монети з мирних мобів у звичайному світі',
        en: '',
      },
      style: { width: '100%' },
    },
    {
      element: 'p',
      value: {
        ru: 'Здесь довольно интересными смотрятся странствующие торговцы и железные големы. Со вторых ко всему прочему ещё и можно лутать железные слитки, которые также достаточно неплохо улетают с полок аукциона.',
        uk: 'Тут досить цікавими виглядають мандрівні торговці та залізні големи. Від останнього, до всього іншого, ви також можете залутати залізні злитки, які також досить добре улітають з аукціонних полиць.',
        en: '',
      },
    },
    {
      element: 'img',
      src: coinsFromMobsHostile,
      alt: {
        ru: 'Монетки с враждебных мобов в обычном мире',
        uk: 'Монети ворожих мобів у звичайному світі',
        en: '',
      },
      style: { width: '100%' },
    },
    {
      element: 'p',
      value: {
        ru: 'Тут можно рассмотреть сразу несколько вариантов. Например, в начале вайпа довольно неплохо можно налутаться на древних стражах, отрубив им плавники в подводных данжах. Кроме этого, можно ещё и построить ферму рейдов, где можно будет убивать сразу несколько существ из этого перечня, зарабатывая действительно неплохие деньги.',
        uk: 'Тут ви можете розглянути кілька варіантів одразу. Наприклад, на початку вайпа досить непогано можна налутатись на стародавніх сторожах, відрізав їх плавники у підводних данжах. Крім того, ви також можете побудувати ферму рейдів, де ви можете вбити кілька істот із цього списку одразу, заробляючи дійсно непогані гроші.',
        en: '',
      },
    },
    {
      element: 'img',
      src: coinsFromMobsNether,
      alt: {
        ru: 'Монетки с мобов в нижнем мире',
        uk: 'Монетки з мобів в нижньому світі',
        en: '',
      },
      style: { width: '100%' },
    },
    {
      element: 'p',
      value: {
        ru: 'Здесь внимание стоит обратить на, например, визер-скелетов, гастов или непосредственно самих визеров. Кроме этого, в начале вайпа довольно неплохой стратегией будет побежать в бастион и отрубить пятаки брутальным пиглинам. На этих парнях можно неплохо поднять деньжат.',
        uk: "Тут слід звернути увагу на, наприклад, візер-скелетів, гастів або безпосередньо самих визерів. Крім того, на початку вайпу досить непоганою стратегією буде прибігти до бастіону і відрубати п'ятаки агресивним піглинам. На цих хлопців ви можете непогано підняти грошей.",
        en: '',
      },
    },
    {
      element: 'img',
      src: coinsFromMobsEnd,
      alt: {
        ru: 'Монетки с мобов в измерению Энда',
        uk: 'Монетки з мобів в вимірюванні Енду',
        en: '',
      },
      style: { width: '100%' },
    },
    {
      element: 'p',
      value: {
        ru: 'Мир Энда похвастаться большим количеством обитателей, к сожалению, совсем не может. Однако монетки с главного его жителя, дракона Края, перекрывают абсолютно все возможные сомнения в величии данного мира — более 5 тысяч монет за раз это вам, друзья, не в муку попёрдывать!',
        uk: 'Світ Енду похвалитися великою кількістю жителів, на жаль, взагалі не може. Однак монетки з його головного жителя, дракону Края, перекривають абсолютно всі можливі сумніви щодо величі цього світу — більше 5 тисяч монет за раз це вам, друзі, не у муку пердіти!',
        en: '',
      },
    },
  ],
};
