import endlessTrading from '../../assets/img/endless-trading.jpg';
import endlessTradingMenu from '../../assets/img/endless-trading-menu.jpg';

export const ENDLESSTRADING = {
  articleName: {
    ru: 'Бесконечная торговля',
    uk: 'Нескінченна торгівля',
    en: '',
  },
  articleAddress: '/endless_trading',
  articleContent: [
    {
      element: 'img',
      src: endlessTrading,
      alt: { ru: 'Бесконечная Торговля', uk: 'Нескінченна торгівля', en: '' },
      style: { width: '100%' },
    },
    {
      element: 'p',
      value: {
        ru: 'Стоит начать с того, как же получить возможность продавать ресурсы БЕСКОНЕЧНО? Все весьма просто. При прохождении Буржуя на все 10 уровней, открывается дополнительная возможность сдавать товары раз в сутки в неограниченном количестве. Меню будет выглядеть следующим образом:',
        uk: 'Варто почати з того, як отримати можливість продавати ресурси НЕСКІНЧЕННО? Все дуже просто. Проходячи Буржуа на всі 10 рівнів, відкривається додаткова можливість здати товари один раз на день у необмежених кількостях. Меню буде виглядати наступним чином:',
        en: '',
      },
    },
    {
      element: 'img',
      src: endlessTradingMenu,
      alt: {
        ru: 'Бесконечная Торговля Меню',
        uk: 'Нескінченна Торгівля Меню',
        en: '',
      },
      style: { width: '80%' },
    },
    {
      element: 'p',
      value: {
        ru: 'Каждые 24 часа в 00:00 предметы меняются, причем индивидуально для каждого игрока.',
        uk: 'Кожні 24 години о 00:00 предмети змінюються, причому індивідуально для кожного гравця.',
        en: '',
      },
    },
    {
      element: 'p',
      value: {
        ru: 'Всего будет 3 главных объекта:',
        uk: "Загалом буде 3 основні об'єкти: ",
        en: '',
      },
    },
    {
      element: 'ol',
      li: {
        ru: [
          'Активирующий артефакт. Он требуется для всей работы бесконечной торговли в целом, без него вы не сможете начать сдавать предметы. При пополнении артефакта все топливо генерируется само, т.е. если вы только установили артефакт, то запитывать систему вам не нужно.',
          'Необходимый предмет (топливо). Рандомные предметы из списка будут появляться в менюшке и играть такую роль как «топливо». Суть в том, что после каждой сдачи стака предметов цена будет падать все ниже и ниже, пока не дойдет до минимума. Когда вы сдадите 200 стаков любого предмета, у вас будет возможность обновить количество сданных вами предметов до нуля. Для этого нужно пополнить каждый предмет из списка топлива. Таким образом торговля может обновляться и обновляться.',
          'Сдаваемый предмет. Также на сайте есть отдельная статья с объяснением всех цен, списком товаров и т.д.:',
        ],
        uk: [
          'Активуючий артефакт. Він потрібен для всієї роботи нескінченної торгівлі взагалі, без нього ви не зможете почати здавати предмети. При поповненні артефакту усе пальне генерується само, тобто якщо ви тільки встановили артефакт, то живити систему вам не потрібно.',
          "Необхідний предмет (пальне). Випадкові предмети зі списку з'являтимуться в меню та виконуватимуть таку роль як «пальне». Суть у тому, що після кожної доставки стаків предметів ціна буде знижуватися все нижче і нижче, поки не сягне мінімуму. Якщо ви доставите 200 стаків будь-якого предмета, у вас буде можливість оновити кількість доставлених вами предметів до нуля. Для цього потрібно поповнити кожен предмет із списку пального. Таким чином, торгівля може оновлюватися і оновлюватися.",
          'Предмет, який треба здати. Також на сайті є окрема стаття з поясненням всіх цін, списком товарів і т.д.:',
        ],
        en: [],
      },
    },
    {
      element: 'link',
      to: '/classic-and-speedrun/pve/bourgeois/info_about_prices_in_endless_trading',
      value: { ru: 'Информация о ценах', uk: 'Інформація про ціни', en: '' },
    },
    {
      element: 'p',
      value: {
        ru: 'Бегом изучать обновления на сервере!',
        uk: 'Бігом вивчати оновлення на сервері!',
        en: '',
      },
    },
  ],
};
