import eventSchedule from '../../assets/img/event-schedule.jpg';

export const EVENTSCHEDULE = {
  articleName: {
    ru: 'Расписание ивентов сервера',
    uk: 'Розклад івентів сервера',
    en: '',
  },
  articleAddress: '/server_event_schedule',
  articleContent: [
    {
      element: 'p',
      value: {
        ru: 'Как вы знаете, у нас на сервере есть несколько крутейших ивентов, к которым относятся:',
        uk: 'Як відомо, у нас на сервері є кілька крутецьких подій, які включають:',
        en: '',
      },
    },
    {
      element: 'ul',
      li: {
        ru: [
          'Боссы — это такие устрашающие мистические существа, которые появляются на спавне на ПВП-арене, с которыми может сразиться каждый игрок и получить награду в виде рубинов и ценнейших ресурсов.',
          'Зажиточный Джейкоб — это достаточно новый персонаж, который появляется на одном из уникальных данжей и приносит с собой бесценные золотые слитки, которые можно у него забрать и получать монетки на свой баланс.',
          'Взрывные грузы — это волшебные ящики, которые появляются в рандомном месте на карте и через некоторое время превращаются в шалкер с ресурсами, среди которых драгоценности, топовая броня и таинственные предметы. Но будьте осторожны, ведь не зря же они называются «взрывными».',
          'Шахтёрский клад — это мистический сундук, который появляется на случайных координатах где-то глубоко под землёй. Найти его не так уж и просто, однако в конечном итоге из клада можно добыть целое множество полезных и крутых вещичек, начиная от буров и крутых кирок, заканчивая редчайшими яйцами призывов бесценных мобов!',
        ],
        uk: [
          'Боси — це такі страхітливі містичні істоти, які з’являються на спавні на Pvp-арені, з якими кожен гравець може битися і отримати нагороду у вигляді рубінів та цінніших ресурсів.',
          'Заможний Джейкоб — це досить новий персонаж, який з’являється в одному з унікальних підземелль і приносить із собою безцінні золоті злитки, які ви можете забрати у нього і отримати монетки на свій баланс.',
          'Вибухонебезпечні товари — це магічні коробки, які з’являються у випадковому місці на карті і через деякий час перетворюються на шалкер з ресурсами, серед яких коштовності, топова броня та загадкові предмети. Але будьте обережні, адже не дарма ж їх називають «вибухонебезпечним».',
          'Швидкий скарб — це містична скриня, яка з’являється на випадкових координатах десь глибоко під землею. Знайти його не так просто, але врешті-решт, зі скарбу можна видобути багато корисних і крутих речей, починаючи від бурів та крутих кирок, закінчуючи рідкісними яйцями безцінних мобів!',
        ],
        en: [],
      },
    },
    {
      element: 'p',
      value: {
        ru: 'Если хотите ознакомиться с более подробной информацией по некоторым из ивентов, то можете почитать соответствующую статью:',
        uk: 'Якщо ви хочете ознайомитись із більш детальною інформацією про деякі події, ви можете прочитати відповідну статтю:',
        en: '',
      },
    },
    {
      element: 'link',
      to: '/classic-and-speedrun/pvp/events/jacob',
      value: { ru: 'Джейкоб', uk: 'Джейкоб', en: '' },
    },
    {
      element: 'link',
      to: '/classic-and-speedrun/pvp/events/bosses',
      value: { ru: 'Боссы', uk: 'Босси', en: '' },
    },
    {
      element: 'p',
      value: {
        ru: 'С графиком работы каждого из событий можете ознакомиться на картинке ниже (МСК). Количество ивентов формируется в зависимости от онлайна, однако в то время, которое отмечено красным цветом, ивенты проходят на всех режимах.',
        uk: 'Ви можете знайти графік роботи кожної з подій на малюнку нижче (МСК). Кількість подій формується залежно від онлайну, але в той час, який позначений червоним кольором, події проходять у всіх режимах.',
        en: '',
      },
    },
    {
      element: 'img',
      src: eventSchedule,
      alt: {
        ru: 'Расписание ивентов сервера',
        uk: 'Розклад івентів сервера',
        en: '',
      },
      style: { width: '100%' },
    },
    {
      element: 'p',
      value: { ru: 'Приятной игры!', uk: 'Приємної гри!', en: '' },
    },
  ],
};
