export const LITEANARCHYHOME = {
  articleName: {
    ru: 'Анархия лайт',
    uk: 'Анархія лайт',
    en: '',
  },
  articleAddress: '',
  articleContent: [
    {
      element: 'h3',
      value: {
        ru: 'Анархия Лайт',
        uk: 'Анархія Лайт',
        en: 'Anarchy Classic',
      },
    },
    {
      element: 'p',
      value: {
        ru: 'Представляет из себя Анархию с более простым, но не менее интересным развитием и процессом игры. Здесь можно взрывать регионы буквально под ноль, получать невозможные зачарования, приобрести донат с крутейшим набором, сходить в потную схватку с топовыми игроками – словом, возможностей и особенностей целое море, советуем изучить детальнее!',
        uk: 'Це є Анархія з більш простим, але не менш цікавим розвитком та геймплейом. Тут можна підривати регіони буквально під нуль, отримувати неможливі зачарування, придбати донат з крутезним набором, піти в гарячу сутичку з топовими гравцями – коротше кажучи, можливостей та особливостей тут багато, радимо вивчити детальніше!',
        en: '',
      },
    },
  ],
};
