import pricesInfo1 from '../../assets/img/prices-info-1.png';
import pricesInfo2 from '../../assets/img/prices-info-2.png';
import pricesInfo3 from '../../assets/img/prices-info-3.png';

export const PRICESINFO = {
  articleName: 'Информация о всех ценах в Бесконечной Торговле',
  articleAddress: '/info_about_prices_in_endless_trading',
  articleContent: [
    {
      element: 'h4',
      value: 'Итак, перейдем к самим предметам, ценам и артефактам.',
    },
    {
      element: 'p',
      value: '1) Возможные предметы, которые могут быть артефактом:',
    },
    {
      element: 'img',
      src: pricesInfo1,
      alt: 'Возможные артефакты',
      style: { width: '100%' },
    },
    {
      element: 'p',
      value:
        'Спавнер ифритов, Спавнер зомби, Спавнер скелетов, Спавнер пауков, Спавнер пещерных пауков, Незеритовый блок, Трезубец, Элитра, Голова крипера, Голова зомби, Череп скелета, Голова дракона, Зачарованное золотое яблоко.',
    },
    {
      element: 'p',
      value: '2) <b>Возможные необходимые предметы для топлива</b>:',
    },
    {
      element: 'img',
      src: pricesInfo2,
      alt: 'Предметы для топлива',
      style: { width: '100%' },
    },
    {
      element: 'p',
      value:
        'Незеритовый слиток, Кристалл Энда, Пузырёк опыта, Золотое яблоко, Лук-батун, Мёртвый куст, Морской источник, Роза визера, Звезда Незера, Мембрана фантома, Раковина Наутилуса, Якорь возрождения, Эндер-сундук, Чародейский стол, Морской фонарь, Динамит, Наковальня, Блок пчелиных сот, Магнетит, Золочёный чернит, Колокол, Шалкеровый Ящик, любая Пластинка.',
    },
    {
      element: 'p',
      value:
        '3) Также стоит добавить, что при каждом проданном стаке цена падает на 1% от цены.',
    },
    {
      element: 'img',
      src: pricesInfo3,
      alt: 'Падение цены',
      style: { width: '100%' },
    },
    {
      element: 'p',
      value:
        'Незеритовый слиток, Кристалл Энда, Пузырёк опыта, Золотое яблоко, Лук-батун, Мёртвый куст, Морской источник, Роза визера, Звезда Незера, Мембрана фантома, Раковина Наутилуса, Якорь возрождения, Эндер-сундук, Чародейский стол, Морской фонарь, Динамит, Наковальня, Блок пчелиных сот, Магнетит, Золочёный чернит, Колокол, Шалкеровый Ящик, любая Пластинка.',
    },
    {
      element: 'p',
      value:
        '<b>Список продаваемых предметов:</b><br>' +
        'Кактус – 500<br>' +
        'Тростник – 500<br>' +
        'Арбуз – 1&nbsp;000<br>' +
        'Тыква – 1&nbsp;000<br>' +
        'Нарост – 1&nbsp;200<br>' +
        'Картофель – 700<br>' +
        'Морковь – 700<br>' +
        'Свёкла – 700<br>' +
        'Пшеница – 900<br>' +
        'Коричневый гриб – 1&nbsp;200<br>' +
        'Красный гриб – 1&nbsp;200<br>' +
        'Багровый гриб – 500<br>' +
        'Искажённый гриб – 700<br>' +
        'Сладкие ягоды – 700<br>' +
        'Какао-боб – 700<br>' +
        'Хорус – 1&nbsp;000<br>' +
        'Гнилая плоть – 600<br>' +
        'Кость – 600<br>' +
        'Стрела – 600<br>' +
        'Паучий глаз – 700<br>' +
        'Нить – 600<br>' +
        'Панцирь шалкера – 60&nbsp;000<br>' +
        'Кожа – 1&nbsp;000<br>' +
        'Стейк – 800<br>' +
        'Жареная свинина – 800<br>' +
        'Перо – 1&nbsp;300<br>' +
        'Жареная курица – 800<br>' +
        'Жареная баранина – 800<br>' +
        'Жареная крольчатина – 1&nbsp;000<br>' +
        'Жареный лосось – 700<br>' +
        'Жареная треска – 700<br>' +
        'Иглобрюх – 900<br>' +
        'Тропическая рыба – 2&nbsp;100<br>' +
        'Огненный стержень – 500<br>' +
        'Череп визер-скелета – 2&nbsp;500<br>' +
        'Сгусток магмы – 600<br>' +
        'Булыжник – 50<br>' +
        'Эндерняк –300<br>' +
        'Незерак – 150<br>' +
        'Андезит – 280<br>' +
        'Гранит – 280<br>' +
        'Диорит – 280<br>' +
        'Гравий – 150<br>' +
        'Песок – 140<br>' +
        'Чернит – 350<br>' +
        'Дуб – 1&nbsp;600<br>' +
        'Ель – 1&nbsp;600<br>' +
        'Акациевое бревно – 1&nbsp;600<br>' +
        'Берёзовое бревно – 1&nbsp;600<br>' +
        'Бревно тёмного дуба – 1&nbsp;600<br>' +
        'Бревно тропического дерева – 1&nbsp;600<br>' +
        'Искажённый стебель – 1&nbsp;600<br>' +
        'Багровый стебель – 1&nbsp;600<br>' +
        'Базальт – 800<br>' +
        'Земля – 250<br>' +
        'Обсидиан – 1&nbsp;400<br>' +
        'Незерские кирпичи – 600<br>',
    },
  ],
};
