import sanctuousJakob from '../../assets/img/sanctuous-jakob.jpg';
import sanctuousJakobBar from '../../assets/img/sanctuous-jakob-bar.jpg';

export const SANCTUOUSJACOB = {
  articleName: 'Джейкоб',
  articleAddress: '/jacob',
  articleContent: [
    {
      element: 'img',
      src: sanctuousJakob,
      alt: 'Зажиточный Джейкоб',
      style: { width: '100%' },
    },
    {
      element: 'h3',
      value: 'Место спавна',
    },
    {
      element: 'p',
      value:
        'Стоит начать с его места спавна и насколько редко он появляется. <b>Несколько раз в день, на одном из уникальных данжей, у его основания</b>. Запомнили? Приходите, в чате напомним.',
    },
    {
      element: 'h3',
      value: 'Механика получения монет',
    },
    {
      element: 'p',
      value:
        'В своих руках Джейкоб изначально держит <b>Бесценный слиток</b>, который можно у него из рук <b>по нажатию ПКМ забрать</b>. Когда какой-то игрок забирает из его рук слиток, Зажиточный Джейкоб больше в руках не держит золотой слиток. Однако не всё так просто.',
    },
    {
      element: 'p',
      value:
        'Человек, обладающий слитком и находящийся в радиусе <b>20 блоков</b> от Зажиточного Джейкоба, каждую секунду получает <b>10 монет</b> на свой баланс.',
    },
    {
      element: 'p',
      value:
        '<b>Спустя минуту</b> после того, как у Джейкоба из рук забирают один слиток, <b>сразу же появляется новый</b>. Если человек имеет в инвентаре <b>одновременно 2 слитка</b>, то он ежесекундно <b>получает 20 монеток</b>. Если 3 – 30 монеток и т.д.',
    },
    {
      element: 'h3',
      value: 'Основные положения и важные аспекты',
    },
    {
      element: 'p',
      value:
        'Если человек, обладающий <b>Бесценным слитком</b>, находится <b>в радуисе 20 блоков</b> от <b>Зажиточного Джейкоба</b>, то он становится <b>подсвеченным</b>. Скрыться никому не получится…',
    },
    {
      element: 'p',
      value:
        'Если человек, обладающий <b>Бесценным слитком</b>, находится на расстоянии <b>в более чем 20 блоках</b> от <b>Зажиточного Джейкоба</b> более чем 15 секунд, то слиток из его инвентаря пропадает, игрок больше не подсвечивается. Скоммуниздить и спрятать – даже не мечтайте.',
    },
    {
      element: 'p',
      value:
        'Если человек, обладающий <b>Бесценным слитком</b>, находится на расстоянии <b>в более чем 20 блоках</b> от Зажиточного Джейкоба, то он не получает ни одной монетки. Сражайтесь, а не ныкайтесь!',
    },
    {
      element: 'p',
      value:
        'Если человек, который обладает <b>Бесценным слитком</b>, умирает, то этот слиток выпадает. Его можно подобрать, и, если находиться <b>в радиусе 20 блоков</b> от <b>Зажиточного Джейкоба</b>, то он будет начислять монетки, то есть работать как обычно.',
    },
    {
      element: 'p',
      value:
        'Кроме того, <b>как только Зажиточный Джейкоб пропадает</b>, на его месте <b>появляться сундук</b>, в котором будет спавниться ценный лут. Ох и щедрая душа конечно…',
    },
    {
      element: 'p',
      value:
        'Примерно время существования – 25-45 минут. Обогатиться успеет каждый, главное – не щёлкать челюстью!',
    },
    {
      element: 'p',
      value:
        'И главное помните, Джейкоб – не Джейк. Джейк – не Джейкоб. Вперед за истиной!',
    },
    {
      element: 'img',
      src: sanctuousJakobBar,
      alt: 'Зажиточный Джейкоб: появление слитка',
      style: { width: '100%' },
    },
  ],
};
