import sanctuousJakob from '../../assets/img/sanctuous-jakob.jpg';
import sanctuousJakobBar from '../../assets/img/sanctuous-jakob-bar.jpg';

export const SANCTUOUSJACOB = {
  articleName: {
    ru: 'Джейкоб',
    uk: 'Джейкоб',
    en: '',
  },
  articleAddress: '/jacob',
  articleContent: [
    {
      element: 'img',
      src: sanctuousJakob,
      alt: { ru: 'Зажиточный Джейкоб', uk: 'Заможний Джейкоб', en: '' },
      style: { width: '100%' },
    },
    {
      element: 'h3',
      value: { ru: 'Место спавна', uk: 'Місце спавну', en: '' },
    },
    {
      element: 'p',
      value: {
        ru: 'Стоит начать с его места спавна и насколько редко он появляется.<b> Несколько раз в день, на одном из уникальных данжей, у его основания</b>. Запомнили? Приходите, в чате напомним.',
        uk: "Варто почати з його місця спавна і як рідко він з'являється.<b> Кілька разів на день, в одному з унікальних підземелль, в його основі</b>. Запам'ятали? Приходьте, нагадаємо у чаті.",
        en: '',
      },
    },
    {
      element: 'h3',
      value: {
        ru: 'Механика получения монет',
        uk: 'Механіка отримання монет',
        en: '',
      },
    },
    {
      element: 'p',
      value: {
        ru: 'В своих руках Джейкоб изначально держит <b>Бесценный слиток</b>, который можно у него из рук <b>по нажатию ПКМ забрать</b>. Когда какой-то игрок забирает из его рук слиток, Зажиточный Джейкоб больше в руках не держит золотой слиток. Однако не всё так просто.',
        uk: 'В своїх руках Джейкоб спочатку тримає <b>Безцінний злиток</b>, який можна з його рук, <b>натиснувши PKM, забрати </b>. Коли гравець бере злиток з його рук, Заможний Джейкоб більше не тримає в руках золотий злиток. Однак не все так просто.',
        en: '',
      },
    },
    {
      element: 'p',
      value: {
        ru: 'Человек, обладающий слитком и находящийся в радиусе <b>20 блоков</b> от Зажиточного Джейкоба, каждую секунду получает <b>10 монет</b> на свой баланс.',
        uk: 'Людина, яка має злиток і перебуває в радіусі <b>20 блоків</b> від Заможного Джейкоба, кожну секунду отримує <b>10 монет</b> на свій баланс.',
        en: '',
      },
    },
    {
      element: 'p',
      value: {
        ru: '<b>Спустя минуту</b> после того, как у Джейкоба из рук забирают один слиток, <b>сразу же появляется новый</b>. Если человек имеет в инвентаре <b>одновременно 2 слитка</b>, то он ежесекундно <b>получает 20 монеток</b>. Если 3 – 30 монеток и т.д.',
        uk: '<b>Через хвилину</b> після того, як у Джейкоба забрали з рук один злиток, <b>негайно з’являється новий</b>. Якщо у людини одночасно є <b>2 злитки</b>, то він отримує <b>20 монет</b> кожну секунду. Якщо 3 – 30 монет тощо.',
        en: '',
      },
    },
    {
      element: 'h3',
      value: {
        ru: 'Основные положения и важные аспекты',
        uk: 'Основні положення та важливі аспекти',
        en: '',
      },
    },
    {
      element: 'p',
      value: {
        ru: 'Если человек, обладающий <b>Бесценным слитком</b>, находится <b>в радуисе 20 блоков</b> от <b>Зажиточного Джейкоба</b>, то он становится <b>подсвеченным</b>. Скрыться никому не получится…',
        uk: 'Якщо людина, яка має <b>Безцінний злиток</b>, знаходиться <b>у радіусі 20 блоків</b> від <b>Заможного Джейкоба</b>, то він стає <b>підсвіченим</b >. Ніхто не зможе сховатися…',
        en: '',
      },
    },
    {
      element: 'p',
      value: {
        ru: 'Если человек, обладающий <b>Бесценным слитком</b>, находится на расстоянии <b>в более чем 20 блоках</b> от <b>Зажиточного Джейкоба</b> более чем 15 секунд, то слиток из его инвентаря пропадает, игрок больше не подсвечивается. Скоммуниздить и спрятать – даже не мечтайте.',
        uk: 'Якщо людина, яка має <b>Безцінний злиток</b>, знаходиться на відстані <b>у більш ніж 20 блоків</b> від <b>Заможного Джейкоба</b> більше 15 секунд, тоді злиток з його інвентаря зникає, гравець більше не підсвічений. Зкомуниздити та сховатися – навіть не мрійте.',
        en: '',
      },
    },
    {
      element: 'p',
      value: {
        ru: 'Если человек, обладающий <b>Бесценным слитком</b>, находится на расстоянии <b>в более чем 20 блоках</b> от Зажиточного Джейкоба, то он не получает ни одной монетки. Сражайтесь, а не ныкайтесь!',
        uk: 'Якщо людина, яка має <b>Безцінний злиток</b>, знаходиться на відстані <b>у більш ніж 20 блоків</b> від Заможного Джейкоба, то він не отримує жодної монети. Боріться, а не никайтесь!',
        en: '',
      },
    },
    {
      element: 'p',
      value: {
        ru: 'Если человек, который обладает <b>Бесценным слитком</b>, умирает, то этот слиток выпадает. Его можно подобрать, и, если находиться <b>в радиусе 20 блоков</b> от <b>Зажиточного Джейкоба</b>, то он будет начислять монетки, то есть работать как обычно.',
        uk: 'Якщо людина, яка має <b>Безцінний злиток</b>, помирає, то цей злиток випадає. Його можна підібрати, і якщо знаходитись <b>в радіусі 20 блоків</b> від <bЗаможного Джейкоба</b>, то він буде нараховувати монети, тобто працювати як завжди.',
        en: '',
      },
    },
    {
      element: 'p',
      value: {
        ru: 'Кроме того, <b>как только Зажиточный Джейкоб пропадает</b>, на его месте <b>появляться сундук</b>, в котором будет спавниться ценный лут. Ох и щедрая душа конечно…',
        uk: "Крім того, <b>як тільки Заможній Джейкоб зникає</b>, на його місці <b>з'являється скриня</b>, в якій буде спавнитися цінний лут. Ох і щедра душа…",
        en: '',
      },
    },
    {
      element: 'p',
      value: {
        ru: 'Примерное время существования – 25-45 минут. Обогатиться успеет каждый, главное – не щёлкать челюстью!',
        uk: 'Приблизний час існування становить 25-45 хвилин. Усі встигнуть збагатити себе, головне – не клацати щелепою!',
        en: '',
      },
    },
    {
      element: 'p',
      value: {
        ru: 'И главное помните, Джейкоб – не Джейк. Джейк – не Джейкоб. Вперед за истиной!',
        uk: 'І найголовніше, пам’ятайте, Джейкоб – це не Джейк. Джейк – не Джейкоб. Вперед за істиною!',
        en: '',
      },
    },
    {
      element: 'img',
      src: sanctuousJakobBar,
      alt: {
        ru: 'Зажиточный Джейкоб: появление слитка',
        uk: 'Заможній Джейкоб: поява злитку',
        en: '',
      },
      style: { width: '100%' },
    },
  ],
};
