import uniqueDungeon1 from '../../assets/img/unique-dungeon-1.jpg';
import uniqueDungeon2 from '../../assets/img/unique-dungeon-2.jpg';
import uniqueDungeon3 from '../../assets/img/unique-dungeon-3.jpg';

export const UNIQUEDUNGEONS = {
  articleName: {
    ru: 'Уникальные данжи',
    uk: 'Унікальні данжи',
    en: '',
  },
  articleAddress: '/unique_dungeons',
  articleContent: [
    {
      element: 'p',
      value: {
        ru: 'В этой статье речь пойдет про обновлённые уникальные данжи. Это структуры, которые генерируются во всех трёх мирах каждой анархии в ограниченном количестве. Каждый такой данж содержит в себе 2-3 шалкера, в которых вы гарантированно найдёте 1-3 редких предмета (яйца призыва или таинственные предметы из /shop) и 8-16 обычных предметов (еду, драгоценности или расходники).',
        uk: 'Ця стаття розповість про оновлені унікальні данжи. Це структури, які генеруються у всіх трьох світах кожної анархії в обмеженій кількості. Кожен такий данж містить 2-3 шалкери, в яких ви гарантовано знайдете 1-3 рідкісні предмети (яйця призиву або загадкові предмети з /shop) та 8-16 звичайних предметів (їжу, коштовності або знадиво).',
        en: '',
      },
    },
    {
      element: 'p',
      value: {
        ru: 'При этом, находящиеся внутри шалкеров предметы распределены по измерениям. К примеру, только в данжах адского измерения вы можете найти яйцо призыва визер-скелета или взрывоопасные якоря возрождения, в то время как в данжах Энда у вас есть шанс отыскать яйцо эндермена, шалкера или же "Собственность Карлсона" – неразрушимую элитру. С полным списком дропа в хранилищах из разных измерений вы можете ознакомиться на картинках ниже.',
        uk: 'У той же час, предмети які розташовані всередині шалкерів, розподілені за вимірами. Наприклад, лише в підземеллях пекельного вимірювання ви можете знайти яйце призиву візер-скелета або вибухонебезпечні якоря відродження, у той час як у данжах Енду у вас є можливість знайти яйце ендермена, шалкера чи навіть "Майно Карлсона" – неруйнівну елітру. Повний перелік предметів, що падають з різних вимірів, можна переглянути на зображеннях нижче.',
        en: '',
      },
    },
    {
      element: 'p',
      value: {
        ru: 'Важно понимать, что данжи достаточно часто обновляются, в связи с чем их облик может отличаться, однако лут остаётся неизменным',
        uk: "Важливо розуміти, що данжи оновлюються досить часто, у зв'язку з чим їх зовнішній вигляд може відрізнятися, але лут залишається незмінним",
        en: '',
      },
    },
    {
      element: 'img',
      src: uniqueDungeon1,
      alt: {
        ru: 'Данжи обычного измерения',
        uk: 'Данжи звичайного вимірювання',
        en: '',
      },
      style: { width: '100%' },
    },
    {
      element: 'img',
      src: uniqueDungeon2,
      alt: {
        ru: 'Данжи адского измерения',
        uk: 'Данжи пекельного вимірювання',
        en: '',
      },
      style: { width: '100%' },
    },
    {
      element: 'img',
      src: uniqueDungeon3,
      alt: {
        ru: 'Данжи измерения энда',
        uk: 'Данжи вимірювання енда',
        en: '',
      },
      style: { width: '100%' },
    },
    {
      element: 'p',
      value: {
        ru: 'Открыть заветные шалкера в особых данжах можно только специальным ключом, найти который вы можете во всех ванильных структурах, взрывных грузах, получить за прохождение ежедневных миссий или купить в магазине /shop за рубины.',
        uk: 'Ви можете відкрити заповітний шалкер у спеціальних данжах лише спеціальним ключем, який ви можете знайти у всіх ванільних структурах, вибухонебезпечних вантажах, отримати за проходження щоденних місій або придбати в магазині /shop за рубіни.',
        en: '',
      },
    },
    {
      element: 'p',
      value: {
        ru: 'Кроме того, первый за вайп игрок, который откроет уникальный данж в конкретном измерении, получит особый титул в единственном экземпляре, а его ник будет выведен в общий чат. Так что пока не поздно заходите на сервер и поторопитесь залутать данжи, пока это не сделал кто-то другой!',
        uk: 'Крім того, перший гравець за вайп, який відкриє унікальний данж в певному вимірі, отримає особливий титул у єдиному екземплярі, а його нік буде виведений у спільний чат. Так що поки не пізно заходьте на сервер і поспішіть залутати данжі, поки хтось інший не зробив це!',
        en: '',
      },
    },
  ],
};
